app/views/orders/index.html.erb

SELECT "users".* FROM "users" INNER JOIN "orders_shopkeepers" ON "users"."id" = "orders_shopkeepers"."shopkeeper_id" WHERE "users"."type" IN ('Shopkeeper') AND "orders_shopkeepers"."order_id" = 3
---
    <td><%= order.cart.shopper.username %></td>
    <td><% order.shopkeepers.each do |shopkeeper|%><%=shopkeeper.username + " " %><%end%></td>

SELECT "orders".* FROM "orders"
---

  <% current_user.get_store_orders().each do |order| %>

SELECT "items".* FROM "items" INNER JOIN "items_orders" ON "items"."id" = "items_orders"."item_id" WHERE "items_orders"."order_id" = 28
---
      <td><%= order.cart.shopper.username %></td>
      <td><% order.items.each do |item|%><%=item.name + " " %><%end%></td>