app/views/orders/show.html.erb

SELECT "items".* FROM "items" INNER JOIN "items_orders" ON "items"."id" = "items_orders"."item_id" WHERE "items_orders"."order_id" = 35
---
  </tr>
<% @order.items.each do |item| %>