app/views/saveds/index.html.erb

SELECT "items".* FROM "items" INNER JOIN "items_saveds" ON "items"."id" = "items_saveds"."item_id" WHERE "items_saveds"."saved_id" = 3
---

        <% cart.items.each do |item| %>

SELECT "carts".* FROM "carts" WHERE "carts"."saved_id" = 3
SELECT 1 AS one FROM "items" INNER JOIN "carts_items" ON "items"."id" = "carts_items"."item_id" WHERE "carts_items"."cart_id" = 72 AND "items"."id" = 24 LIMIT 1
---
    <td><%=button_to "Remove from Saved", remove_item_path(item: item.id), :class => "btn btn-small btn-danger"%></td>
    <% if !current_user.cart.items.include?(item) %>