app/views/items/index.html.erb

      <td><%= button_to 'Destroy', item, method: :delete, data: { confirm: 'Are you sure?' }, :class => "btn btn-small btn-danger" %></td>
    <% elsif !current_user.saved.items.include?(item) %>
---
SELECT "items".* FROM "items"
SELECT 1 AS one FROM "items" INNER JOIN "items_saveds" ON "items"."id" = "items_saveds"."item_id" WHERE "items_saveds"."saved_id" = 3 AND "items"."id" = 24 LIMIT 1

      <td></td>
    <% elsif !current_user.cart.items.include?(item) %>
---
SELECT "items".* FROM "items" INNER JOIN "carts_items" ON "items"."id" = "carts_items"."item_id" WHERE "carts_items"."cart_id" = 42
SELECT 1 AS one FROM "items" INNER JOIN "carts_items" ON "items"."id" = "carts_items"."item_id" WHERE "carts_items"."cart_id" = 42 AND "items"."id" = 20 LIMIT 1