app/controllers/carts_controller.rb

  def add_to_cart
    if !current_user.cart
      current_user.cart = Cart.create()
    end
    current_user.cart.items.push(Item.find(params[:item]))
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "25"]]

  def remove_from_cart
  	item = current_user.cart.items.find(params[:item])
---
SELECT "items".* FROM "items" INNER JOIN "carts_items" ON "items"."id" = "carts_items"."item_id" WHERE "carts_items"."cart_id" = 7 AND "items"."id" = ? LIMIT 1  [["id", "11"]]