app/controllers/items_controller.rb

  def new
    @item = User.find(session[:user_id]).items.new
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]

  def create
    @item = User.find(session[:user_id]).items.new(params[:item])
    shopkeeper = @item.shopkeeper

    respond_to do |format|
      if @item.save
---
SELECT "users".* FROM "users" WHERE "users"."type" IN ('Shopkeeper') AND "users"."id" = 32 LIMIT 1
INSERT INTO "items" ("created_at", "description", "name", "price", "quantity", "shopkeeper_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def add_to_cart
    if !current_user.cart
      current_user.cart = Cart.create()
    end
    current_user.cart.items.push(Item.find(params[:item]))
---
INSERT INTO "carts" ("created_at", "shopper_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 12 Mar 2013 01:38:11 UTC +00:00], ["shopper_id", nil], ["updated_at", Tue, 12 Mar 2013 01:38:11 UTC +00:00]]
SELECT "items".* FROM "items" INNER JOIN "carts_items" ON "items"."id" = "carts_items"."item_id" WHERE "carts_items"."cart_id" = 5
UPDATE "carts" SET "shopper_id" = 4, "updated_at" = '2013-03-12 01:38:11.673057' WHERE "carts"."id" = 5