app/controllers/orders_controller.rb

	def index
		@orders = []
		current_user.cart.orders.each do |order|
			@orders.push(order)
		end
		current_user.saved.carts.each do |cart|
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 14 LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."cart_id" = 44
SELECT "carts".* FROM "carts" WHERE "carts"."saved_id" = 5
SELECT "saveds".* FROM "saveds" WHERE "saveds"."id" = 7 LIMIT 1

	def create
		@cart = Cart.find(params[:cart])
		@order = @cart.orders.create()
		if @order.save
			@cart.items.each do |item|
				# add items and respective shopkeepers to order
				# make a copy of the item so that item remains if order if deleted by shopkeeper
				@order.items << Item.create(:name => item.name, :description => item.description, :price => item.price)
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 72 LIMIT 1
INSERT INTO "carts" ("created_at", "saved_id", "shopper_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 17 Mar 2013 15:04:19 UTC +00:00], ["saved_id", nil], ["shopper_id", nil], ["updated_at", Sun, 17 Mar 2013 15:04:19 UTC +00:00]]
INSERT INTO "orders" ("cart_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["cart_id", nil], ["created_at", Tue, 12 Mar 2013 07:45:27 UTC +00:00], ["updated_at", Tue, 12 Mar 2013 07:45:27 UTC +00:00]]
SELECT "orders".* FROM "orders" WHERE "orders"."cart_id" = 14 LIMIT 1
UPDATE "carts" SET "shopper_id" = 26, "updated_at" = '2013-03-12 08:45:04.230011' WHERE "carts"."id" = 23
UPDATE "orders" SET "cart_id" = NULL, "updated_at" = '2013-03-12 07:46:23.625644' WHERE "orders"."id" = 3
SELECT "items".* FROM "items" INNER JOIN "carts_items" ON "items"."id" = "carts_items"."item_id" WHERE "carts_items"."cart_id" = 14
INSERT INTO "items" ("created_at", "description", "name", "price", "shopkeeper_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)