app/controllers/saveds_controller.rb

	def index
		saved = current_user.saved
---
INSERT INTO "saveds" ("created_at", "shopper_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 17 Mar 2013 03:55:43 UTC +00:00], ["shopper_id", 44], ["updated_at", Sun, 17 Mar 2013 03:55:43 UTC +00:00]]

	def add_item
		current_user.saved.items.push(Item.find(params[:item]))
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "24"]]

	def add_cart
		cart = Cart.create()
		Cart.find(params[:cart]).items.each do |item|
			cart.items.push(item)
---
INSERT INTO "carts" ("created_at", "saved_id", "shopper_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 17 Mar 2013 14:44:07 UTC +00:00], ["saved_id", nil], ["shopper_id", nil], ["updated_at", Sun, 17 Mar 2013 14:44:07 UTC +00:00]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "72"]]
SELECT "items".* FROM "items" INNER JOIN "carts_items" ON "items"."id" = "carts_items"."item_id" WHERE "carts_items"."cart_id" = 72
UPDATE "carts" SET "saved_id" = 3, "updated_at" = '2013-03-17 14:41:34.341727' WHERE "carts"."id" = 72

	def remove_item
		saved = current_user.saved
		item = saved.items.find(params[:item])
---
SELECT "items".* FROM "items" INNER JOIN "items_saveds" ON "items"."id" = "items_saveds"."item_id" WHERE "items_saveds"."saved_id" = 3 AND "items"."id" = ? LIMIT 1  [["id", "24"]]

	def remove_cart
		cart = current_user.saved.carts.find(params[:cart])
    #saved.carts.delete(cart)
    cart.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."saved_id" = 3 AND "carts"."id" = ? LIMIT 1  [["id", "72"]]
UPDATE "carts" SET "saved_id" = NULL WHERE "carts"."saved_id" = 3 AND "carts"."id" IN (72)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 74]]