app/controllers/shopkeepers_controller.rb

	def create
		@user = Shopkeeper.new(params[:shopkeeper])
		if @user.save
---
INSERT INTO "users" ("created_at", "password_digest", "type", "updated_at", "username") VALUES (?, ?, ?, ?, ?)

  def destroy
    @user = Shopkeeper.find(params[:id])
    @user.destroy
---
DELETE FROM "users" WHERE "users"."type" IN ('Shopkeeper') AND "users"."id" = ?  [["id", 2]]