app/controllers/shoppers_controller.rb

	def create
		@user = Shopper.new(params[:shopper])
		if @user.save
---
INSERT INTO "users" ("created_at", "password_digest", "type", "updated_at", "username") VALUES (?, ?, ?, ?, ?)

  def destroy
    @user = Shopper.find(params[:id])
    @user.destroy
---
DELETE FROM "users" WHERE "users"."type" IN ('Shopper', 'Shopkeeper') AND "users"."id" = ?  [["id", 1]]