app/controllers/users_controller.rb

	def create
		# 1 for checked -> create shopkeeper
		# 0 for unchecked -> create shopper
		if (params[:user]["isShopkeeper"] == "1")
			params[:user]["isShopkeeper"] = true
			@user = User.new(params[:user])
		else
			params[:user]["isShopkeeper"] = false
			@user = User.new(params[:user])
		end
		if @user.save
---
INSERT INTO "users" ("created_at", "email", "isShopkeeper", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)