app/views/shopkeepers/index.html.erb

SELECT COUNT(*) FROM "items" WHERE "items"."shopkeeper_id" = 46
---
    <td><%= shopkeeper.username %></td>
    <td><%= shopkeeper.items.size %></td>